app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "image", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Hello this is 2nd post"], ["image", "second.jpeg"], ["user_id", 1], ["created_at", "2023-08-23 07:41:52.207344"], ["updated_at", "2023-08-23 07:41:52.207344"]]
---
    def create
        @posts = Post.new(post_params)
        if @posts.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "image" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "Third Post"], ["image", "Third.jpeg"], ["updated_at", "2023-08-23 10:14:20.783296"], ["id", 5]]
---
    def update
        @posts = Post.find(params[:id])
        if @posts.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 8]]
---
    def destroy
        @posts = Post.find(params[:id])
        @posts.destroy