app/controllers/users_controller.rb

    def create
        @user =User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("email", "password", "fname", "lname", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["email", "RK@gmail.com"], ["password", "[FILTERED]"], ["fname", "Ram"], ["lname", "Kushwah"], ["created_at", "2023-08-22 13:19:20.428970"], ["updated_at", "2023-08-22 13:19:20.428970"]]

    def user_post
        @user=User.find(params[:id])
        follower_ids = @user.followers.pluck(:follower_id)
        followee_ids = @user.followees.pluck(:followee_id)
        post_user_ids = (follower_ids + followee_ids + [@user.id]).uniq
        @posts = Post.where(user_id: post_user_ids)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 5]]

    def show
        @user = User.find_by_fname(params[:fname])
---
SELECT "users".* FROM "users" WHERE "users"."fname" IS NULL LIMIT ?  [["LIMIT", 1]]